## ðŸ“˜ Lesson 1: Pandas Basics

Pandas is a Python library used for data manipulation and analysis.  
In this lesson, we learned how to create **Series** and **DataFrames**, explore data, and perform basic indexing.

ðŸ§  What We Covered
- Importing Pandas & NumPy
- Creating Series
- Creating DataFrames
- Accessing rows and columns (loc, iloc)
- Basic filtering and operations
- Exporting Data to CSV


ðŸ’¡ Key Idea
A **Series** = One-dimensional labeled data  
A **DataFrame** = Two-dimensional table (rows + columns)

Step 1 - Import and Version Check

In [1]:
import pandas as pd
import numpy as np 

print("Pandas version:", pd.__version__)

Pandas version: 2.3.3

Step 2 â€“ Create Your First Series

A Series is a one-dimensional labeled array capable of holding any data type.

In [2]:
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

Question: Do you notice how Pandas automatically creates the index (0, 1, 2, â€¦)?
Try this variation to customize the index:

In [3]:
series = pd.Series(data, index=['A', 'B', 'C', 'D', 'E'])
print(series)

A    10
B    20
C    30
D    40
E    50
dtype: int64

Mini Task:
Print:

series.values

series.index

series.dtype

Access element 'C' using series['C']

In [4]:
print(series.values)

[10 20 30 40 50]

In [5]:
print(series.index)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [6]:
print(series.dtype)

int64

In [7]:
print(series['C'])

30

Step 3 â€“ Create Your First DataFrame

Now letâ€™s make a small table (2D data):

In [8]:
data = {
    'Name': ['Piyush', 'Amit', 'Sneha', 'Ravi'],
    'Age': [26, 25, 27, 24],
    'City': ['Bhopal', 'Delhi', "Pune", "Mumbai"]
}

df = pd.DataFrame(data)
print(df)

     Name  Age    City
0  Piyush   26  Bhopal
1    Amit   25   Delhi
2   Sneha   27    Pune
3    Ravi   24  Mumbai

In [9]:
df.head() # first 5 rows

     Name  Age    City
0  Piyush   26  Bhopal
1    Amit   25   Delhi
2   Sneha   27    Pune
3    Ravi   24  Mumbai

In [10]:
df.info() # summary info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [11]:
df.describe() # Statical summary

             Age
count   4.000000
mean   25.500000
std     1.290994
min    24.000000
25%    24.750000
50%    25.500000
75%    26.250000
max    27.000000

Step 4 â€“ Accessing Columns and Rows

In [12]:
print(df['Name']) # single column

0    Piyush
1      Amit
2     Sneha
3      Ravi
Name: Name, dtype: object

In [15]:
print(df[['Name', 'City']]) # multiple columns !Be sure put in double square brackets

     Name    City
0  Piyush  Bhopal
1    Amit   Delhi
2   Sneha    Pune
3    Ravi  Mumbai

In [16]:
print(df.iloc[1])   # access by row position

Name     Amit
Age        25
City    Delhi
Name: 1, dtype: object

In [19]:
print(df.loc[2, 'Name']) # access by row laabe and column)

Sneha

Mini Task:
Add a new column called Salary with these values: [55000, 60000, 65000, 62000]

Then print the DataFrame again.

In [20]:
df['Salary'] = [55000, 60000, 65000, 62000]

print(df)

     Name  Age    City  Salary
0  Piyush   26  Bhopal   55000
1    Amit   25   Delhi   60000
2   Sneha   27    Pune   65000
3    Ravi   24  Mumbai   62000

Step 5 â€“ Filtering and Conditions

You can filter data like this:

In [26]:
df[df['Age'] > 25]

     Name  Age    City  Salary
0  Piyush   26  Bhopal   55000
2   Sneha   27    Pune   65000

In [27]:
df[(df['Age'] > 25) & (df["City"] == 'Pune')]

    Name  Age  City  Salary
2  Sneha   27  Pune   65000

Mini Task:
Show only names of people older than 25.

In [33]:
df[df['Age'] > 25]['Name']

0    Piyush
2     Sneha
Name: Name, dtype: object

Step 6 â€“ Basic Operations

In [34]:
print(df['Age'].mean())

25.5

In [35]:
print(df['Salary'].max())

65000

In [36]:
print(df['Salary'].min())

55000

Mini Task:
Add a new column Tax = 10% of Salary
and a column Net Salary = Salary - Tax

In [38]:
df['Tax'] = df['Salary'] * 0.10
print(df)

     Name  Age    City  Salary     Tax
0  Piyush   26  Bhopal   55000  5500.0
1    Amit   25   Delhi   60000  6000.0
2   Sneha   27    Pune   65000  6500.0
3    Ravi   24  Mumbai   62000  6200.0

In [39]:
df['Net Salary'] = df['Salary'] - df['Tax']
print(df)

     Name  Age    City  Salary     Tax  Net Salary
0  Piyush   26  Bhopal   55000  5500.0     49500.0
1    Amit   25   Delhi   60000  6000.0     54000.0
2   Sneha   27    Pune   65000  6500.0     58500.0
3    Ravi   24  Mumbai   62000  6200.0     55800.0

Step 7 â€“ Save and Load Data

Save your DataFrame as a CSV and read it back:

In [42]:
df.to_csv('data/employees.csv', index=False)
df_loaded = pd.read_csv('data/employees.csv')
print(df_loaded)

     Name  Age    City  Salary     Tax  Net Salary
0  Piyush   26  Bhopal   55000  5500.0     49500.0
1    Amit   25   Delhi   60000  6000.0     54000.0
2   Sneha   27    Pune   65000  6500.0     58500.0
3    Ravi   24  Mumbai   62000  6200.0     55800.0

## âœ… Summary

- Pandas Series and DataFrames are the core structures in Pandas.
- We learned how to access, slice, filter, sort, and export data.
- These operations form the foundation for all real-world data analysis tasks.